exports.toCN = {
	name: "数字转中文",
	its:[
		{
			name: "整数",
			data:[
				["0", "零"],
				["00", "零"],
				["000", "零"],
				["1", "一"],
				["001", "一"],
				["010", "一十"],
				["0010", "一十"],
				["12", "一十二",],
				["3456789", "三百四十五万六千七百八十九"],
				["1001000021", "一十亿零一百万零二十一"],
				["10000000000000000", "一亿亿"],
				["100000001100000000", "一十亿零一十一亿"]
			]
		},
		{
			name: "有小数",
			data:[
				["0.0", "零"],
				["1.0", "一"],
				["1.00", "一"],
				["0.1", "零点一"],
				["00.1", "零点一"],
				["01.1", "一点一"],
				["1.10", "一点一"],
				["10.01", "一十点零一"],
				["100111.11", "一十万零一百一十一点一一"],
				["1e16", "一亿亿"]
			]
		},
		{
			name:"科学记数法",
			data:[
				["100e-3", "零点一"],
				["1.01e+3", "一千零一十"],
				["1.01e3", "一千零一十"],
				["1.01E3", "一千零一十"]
			]
		},
		{
			name:"十的口语化测试",
			args: {tenMin:true},
			data:[
				["10", "十"],
				["15", "十五"],
				["100000", "十万"],
				["1000100000", "十亿零十万"]
			]
		},
		{
			name:"单位万万化",
			args: {ww:true},
			data:[
				["1e16", "一万万亿"],
				["10.011e16", "一十万万零一百一十万亿"]
			]
		}
	]
}

exports.toMoney = {
	name: "数字转人民币金额",
	its:[
		{
			name: "整数",
			data:[
				["0", "人民币零元整"],
				["00", "人民币零元整"],
				["000", "人民币零元整"],
				["1", "人民币壹元整"],
				["001", "人民币壹元整"],
				["010", "人民币壹拾元整"],
				["0010", "人民币壹拾元整"],
				["12", "人民币壹拾贰元整",],
				["3456789", "人民币叁佰肆拾伍万陆仟柒佰捌拾玖元整"],
				["1001000021", "人民币壹拾亿零壹佰万零贰拾壹元整"],
				["10000000000000000", "人民币壹万万亿元整"],
				["100000001100000000", "人民币壹拾万万零壹拾壹亿元整"]
			]
		},
		{
			name: "有小数",
			data:[
				["0.0", "人民币零元"],
				["0.001", "人民币零元"],
				["1.0", "人民币壹元"],
				["1.00", "人民币壹元"],
				["0.1", "人民币壹角"],
				["00.1", "人民币壹角"],
				["01.1", "人民币壹元壹角"],
				["1.10", "人民币壹元壹角"],
				["10.01", "人民币壹拾元零壹分"],
				["10.012", "人民币壹拾元零壹分"],
				["100111.11", "人民币壹拾万零壹佰壹拾壹元壹角壹分"]
			]
		},
		{
			name:"科学记数法",
			data:[
				["100e-3", "人民币壹角"],
				["1.01e+3", "人民币壹仟零壹拾元整"],
				["1.01e3", "人民币壹仟零壹拾元整"],
				["1.01E3", "人民币壹仟零壹拾元整"]
			]
		},
		{
			name:"完整格式测试",
			args: {complete:true},
			data:[
				["10", "人民币壹拾元零角零分"],
				["0", "人民币零元零角零分"],
				["0.1", "人民币零元壹角零分"],
				["0.01", "人民币零元零角壹分"]
			]
		},
		{
			name:"不输出前辍",
			args: {outSymbol:false},
			data:[
				["1", "壹元整"]
			]
		}
	]
}